# Задача №1
# Тема: Доступ к символам строки

# 1. Создай переменную со строковым значением "Automation".

# 2. Самостоятельно придумай понятное имя переменной
#    в стиле snake_case.

# 3. Получи первый символ строки и выведи его на экран.

# 4. Получи четвёртый символ строки и выведи его на экран.

# 5. Получи последний символ строки и выведи его на экран.

# 6. Для получения символов используй индексацию строки.

# Ожидаемый результат:
# A
# o
# n


# Твоё решение:

test_type = "Automation"

print(test_type[0])
print(test_type[3])
print(test_type[-1])

# Задача №2
# Тема: Срезы строк

# 1. Создай переменную со строковым значением "PythonTesting".

# 2. Самостоятельно придумай понятное имя переменной
#    в стиле snake_case.

# 3. С помощью среза получи первые 6 символов строки
#    и выведи результат на экран.

# 4. С помощью среза получи последние 7 символов строки
#    и выведи результат на экран.

# 5. С помощью среза получи символы строки
#    со второго по пятый включительно.

# 6. Выведи полученный результат на экран.

# Ожидаемый результат:
# Python
# Testing
# ytho


# Твоё решение:
print("----------task 2")

string = "PythonTesting"

print(string[0:6])

print(string[6:])

print(string[1:5])


# Задача №3
# Тема: Базовые методы строк

# 1. Создай переменную со строковым значением "  PyThOn  ".

# 2. Самостоятельно придумай понятное имя переменной
#    в стиле snake_case.

# 3. Удали пробелы в начале и в конце строки
#    с помощью строкового метода.

# 4. Преобразуй все символы полученной строки
#    в нижний регистр с помощью строкового метода.

# 5. Сохрани результат преобразований
#    в отдельную переменную.

# 6. Выведи полученный результат на экран.

# Ожидаемый результат:
# python


# Твоё решение:
print("----------task 3")

incorrect_str = "  PyThOn  "

result = incorrect_str.strip().lower()

print(result)


# Задача №4
# Тема: F-строки

# 1. Создай переменную для хранения названия теста
#    со строковым значением "Login".

# 2. Создай переменную для хранения HTTP-статуса
#    с целочисленным значением 200.

# 3. Самостоятельно придумай понятные имена
#    для обеих переменных в стиле snake_case.

# 4. Используя f-строку, выведи сообщение,
#    содержащее название теста и его HTTP-статус.

# 5. Не используй конкатенацию строк через +.

# Ожидаемый результат:
# Тест Login завершился со статусом 200


# Твоё решение:

print("---------- Задача №4 ----------")

test_name = "Login"
http_status = 200

result = f"Тест {test_name} завершился со статусом {http_status}"

print(result)


# Задача №5
# Тема: Получение длины строки

# 1. Создай переменную со строковым значением "Test Automation".

# 2. Самостоятельно придумай понятное имя переменной
#    в стиле snake_case.

# 3. Определи количество символов в строке,
#    включая пробел.

# 4. Сохрани полученное количество в отдельную
#    переменную с подходящим именем.

# 5. Выведи количество символов на экран.

# 6. Определи количество символов в строке
#    без учёта пробелов.

# 7. Выведи полученное количество на экран.

# Ожидаемый результат:
# 15
# 14


# Твоё решение:

print("---------- Задача №5 ----------")

name_test = "Test Automation"

string_lenght_with_spaces = len(name_test)

print(string_lenght_with_spaces)

string_lenght_without_spaces = len(name_test.replace(" ", ""))

print(string_lenght_without_spaces)


# Задача №6
# Тема: Конкатенация строк

# 1. Создай переменную со строковым значением "Test".

# 2. Создай вторую переменную со строковым
#    значением "Passed".

# 3. Самостоятельно придумай понятные имена
#    переменных в стиле snake_case.

# 4. Объедини две строки в одну с помощью
#    оператора конкатенации (+).

# 5. Между словами должен быть один пробел.

# 6. Сохрани полученную строку в отдельную
#    переменную с подходящим именем.

# 7. Выведи результат на экран.

# 8. Выведи длину полученной строки на экран.

# Не используй f-строки и метод .join().

# Ожидаемый результат:
# Test Passed
# 11


# Твоё решение:

print("---------- Задача №6 ----------")

a = "Test"
status = "Passed"

result = a + " " + status
print(result)
result_length = len(result)
print(result_length)


# Задача №7
# Тема: Создание строк + повторение изученного

# 1. Создай переменную со строковым значением "  Login Test  ".
#    Сохрани пробелы в начале и конце строки.

# 2. Создай вторую переменную со значением "PASSED".

# 3. Самостоятельно придумай понятные имена
#    переменных в стиле snake_case.

# 4. Удали лишние пробелы из первой строки
#    и преобразуй её в нижний регистр.

# 5. Преобразуй вторую строку так, чтобы
#    первая буква была заглавной,
#    а остальные — строчными.

# 6. Объедини полученные строки в одну
#    с помощью f-строки, разделив их символами " - ".

# 7. Сохрани итоговую строку в отдельную переменную.

# 8. Выведи итоговую строку на экран.

# 9. Выведи длину итоговой строки, включая пробелы.

# 10. Выведи последний символ итоговой строки,
#     используя отрицательную индексацию.

# Ожидаемый результат:
# login test - Passed
# 19
# d


# Твоё решение:

print("---------- Задача №7 ----------")

test = "  Login Test  "
test_status = "PASSED"

test_final = test.strip().lower()
test_status_final = test_status.capitalize()
result = f"{test_final} - {test_status_final}"
print(result)
print(len(result))
print(result[-1])


# Задача №8
# Тема: Срезы строк с шагом

# 1. Создай переменную со строковым значением "ABCDEFGHIJ".

# 2. С помощью среза с шагом 2 получи каждый второй
#    символ строки, начиная с первого.
#    Выведи результат на экран.

# 3. С помощью среза с шагом 2 получи каждый второй
#    символ строки, начиная со второго.
#    Выведи результат на экран.

# 4. С помощью среза с отрицательным шагом
#    выведи всю строку в обратном порядке.

# 5. С помощью среза с отрицательным шагом -2
#    получи каждый второй символ строки,
#    начиная с последнего.
#    Выведи результат на экран.

# 6. Для всех операций используй только срезы.
#    Не используй методы строк.

# Ожидаемый результат:
# ACEGI
# BDFHJ
# JIHGFEDCBA
# JHFDB


# Твоё решение:

print("---------- Задача №8 ----------")

test = "ABCDEFGHIJ"
print (test[::2])
print (test[1::2])
print (test[::-1])
print (test[::-2])
