# Задача №1
# Тема: Переопределение переменной

# 1. Создай переменную status со значением "new".
# 2. Выведи значение переменной status на экран.
# 3. Измени значение переменной status на "completed".
# 4. Снова выведи значение переменной status на экран.

# Ожидаемый результат:
# new
# completed


# Твоё решение:

status = "new"
print(status)
status = "completed"
print(status)


# Задача №2
# Тема: Операции сравнения

# 1. Создай переменную actual_result со значением 200.
# 2. Создай переменную expected_result со значением 201.
# 3. Сравни значения двух переменных на равенство.
# 4. Выведи результат сравнения на экран.

# Ожидаемый результат:
# False


# Твоё решение:

actual_result = 200
expected_result = 201
print(actual_result == expected_result)

# Задача №3
# Тема: Преобразование типов данных

# 1. Создай переменную users_count со строковым значением "15".
# 2. Преобразуй значение переменной users_count в целое число.
# 3. Прибавь к полученному числу 5.
# 4. Выведи результат сложения на экран.

# Ожидаемый результат:
# 20


# Твоё решение:

users_count = "15"
users_count = int(users_count)
result = users_count + 5
print(result)

# Задача №4
# Тема: Арифметические операции

# 1. Создай переменную total_tests со значением 20.
# 2. Создай переменную passed_tests со значением 15.
# 3. Вычисли количество тестов, которые не прошли проверку.
# 4. Сохрани результат в переменную failed_tests.
# 5. Выведи значение переменной failed_tests на экран.

# Ожидаемый результат:
# 5


# Твоё решение:

print("ЗАДАЧА 4")

total_tests = 20
passed_tests = 15
failed_tests = total_tests - passed_tests
print(failed_tests)

# Задача №5
# Тема: Типы данных

# 1. Создай переменную test_name со значением "Login".
# 2. Создай переменную attempts со значением 3.
# 3. Создай переменную execution_time со значением 1.5.
# 4. Создай переменную is_passed со значением True.
# 5. Выведи тип данных каждой переменной на экран.

# Ожидаемый результат:
# <class 'str'>
# <class 'int'>
# <class 'float'>
# <class 'bool'>


# Твоё решение:
print("ЗАДАЧА 5")
test_name = "Login"
attempts = 3
execution_time = 1.5
is_passed = True
print(type(test_name))
print(type(attempts))
print(type(execution_time))
print(type(is_passed))


# Задача №6
# Тема: Именование переменных

# 1. Создай переменную для хранения имени пользователя.
# 2. Назови её user_name и присвой значение "Alex".
# 3. Создай переменную для хранения возраста пользователя.
# 4. Назови её user_age и присвой значение 25.
# 5. Создай переменную для хранения статуса активности.
# 6. Назови её is_active и присвой значение True.
# 7. Выведи значения всех трёх переменных на экран.

# Ожидаемый результат:
# Alex
# 25
# True


# Твоё решение:

user_name = "Alex"
user_age = 25
is_active = True

print(user_name)
print(user_age)
print(is_active)

# Задача №7
# Тема: Объявление переменных и операции сравнения

# 1. Создай переменную для хранения количества
#    успешно пройденных тестов со значением 8.

# 2. Создай переменную для хранения общего
#    количества тестов со значением 10.

# 3. Самостоятельно придумай понятные имена
#    для обеих переменных в стиле snake_case.

# 4. Сравни количество успешно пройденных тестов
#    с общим количеством тестов, чтобы проверить,
#    все ли тесты прошли успешно.

# 5. Сохрани результат сравнения в отдельную
#    переменную с подходящим именем.

# 6. Выведи результат сравнения на экран.

# Ожидаемый результат:
# False


# Твоё решение:
print("task 7")

passed_tests = 8

all_tests = 10

if_all_tests_passed = passed_tests == all_tests

print(if_all_tests_passed)

# Задача №8
# Тема: Классификация по типам данных и преобразование типов

# 1. Создай переменную для хранения HTTP-статуса ответа
#    со строковым значением "200".

# 2. Самостоятельно придумай понятное имя переменной
#    в стиле snake_case.

# 3. Создай вторую переменную со значением 200
#    целочисленного типа.

# 4. Сравни значения двух переменных на равенство
#    и выведи результат на экран.

# 5. Преобразуй значение первой переменной
#    в целочисленный тип.

# 6. Повтори сравнение двух переменных
#    и выведи результат на экран.

# 7. Выведи тип данных первой переменной
#    после преобразования.

# Ожидаемый результат:
# False
# True
# <class 'int'>


# Твоё решение:

print("----------task 8")

http_status = "200"

good_status = 200

print(http_status == good_status)

http_status = int(http_status)

print(http_status == good_status)

print(type(http_status))




