# Задача №1
# Тема: Переопределение переменной

# 1. Создай переменную status со значением "new".
# 2. Выведи значение переменной status на экран.
# 3. Измени значение переменной status на "completed".
# 4. Снова выведи значение переменной status на экран.

# Ожидаемый результат:
# new
# completed


# Твоё решение:

status = "new"
print(status)
status = "completed"
print(status)


# Задача №2
# Тема: Операции сравнения

# 1. Создай переменную actual_result со значением 200.
# 2. Создай переменную expected_result со значением 201.
# 3. Сравни значения двух переменных на равенство.
# 4. Выведи результат сравнения на экран.

# Ожидаемый результат:
# False


# Твоё решение:

actual_result = 200
expected_result = 201
print(actual_result == expected_result)

# Задача №3
# Тема: Преобразование типов данных

# 1. Создай переменную users_count со строковым значением "15".
# 2. Преобразуй значение переменной users_count в целое число.
# 3. Прибавь к полученному числу 5.
# 4. Выведи результат сложения на экран.

# Ожидаемый результат:
# 20


# Твоё решение:

users_count = "15"
users_count = int(users_count)
result = users_count + 5
print(result)

# Задача №4
# Тема: Арифметические операции

# 1. Создай переменную total_tests со значением 20.
# 2. Создай переменную passed_tests со значением 15.
# 3. Вычисли количество тестов, которые не прошли проверку.
# 4. Сохрани результат в переменную failed_tests.
# 5. Выведи значение переменной failed_tests на экран.

# Ожидаемый результат:
# 5


# Твоё решение:

