# Задача №1
# Лекция №6: Циклы
# Тема: Цикл for — итерация элементов списка

# Дано:
fruits = ["apple", "banana", "orange"]

# Используя цикл for, выведи каждый фрукт из списка с новой строки.
# Ожидаемый результат:
# apple
# banana
# orange
print("---------- Задача №1 ----------")

for fruit in fruits:
    print(fruit)

# Задача №2
# Лекция №6: Циклы
# Тема: Цикл while — итерация элементов списка

# Дано:
numbers = [3, 6, 9, 12]

# Используя цикл while, выведи каждый элемент списка
# с новой строки.
# Ожидаемый результат:
# 3
# 6
# 9
# 12
print("---------- Задача №2 ----------")
i = 0
while i < len(numbers):
    print(numbers[i])
    i = i + 1

# Задача №3
# Лекция №6: Циклы
# Тема: Цикл for — остановка цикла с помощью break

# Дано:
animals = ["cat", "dog", "parrot", "fish"]

# Используя цикл for, перебирай животных.
# Когда встретится "parrot", останови цикл с помощью break.
# Каждое животное до остановки выводи с новой строки.
# Ожидаемый результат:
# cat
# dog
# parrot
print("---------- Задача №3 ----------")

for animal in animals:
    print(animal)
    if animal == "parrot":
        break


# Задача №4
# Лекция №6: Циклы
# Тема: Функция range() в цикле for

# Выведи числа от 1 до 5 включительно,
# используя цикл for и функцию range().
# Каждое число выводи с новой строки.
# Ожидаемый результат:
# 1
# 2
# 3
# 4
# 5
print("---------- Задача №4 ----------")

for number in range(1,6):
    print(number)


# Задача №5
# Лекция №6: Циклы
# Тема: Цикл for — итерация элементов словаря

# Дано:
user = {
    "name": "Alex",
    "city": "Amsterdam",
    "language": "Python"
}

# Используя цикл for, перебери все ключи словаря.
# Выведи каждый ключ с новой строки.
# Ожидаемый результат:
# name
# city
# language
print("---------- Задача №5 ----------")

for key in user.keys():
    print(key)

# Задача №6
# Лекция №6: Циклы
# Тема: Цикл while — итерация элементов списка

# Дано:
colors = ["red", "green", "blue"]

# Используя цикл while, выведи каждый цвет из списка
# с новой строки.
# Не используй цикл for.
# Ожидаемый результат:
# red
# green
# blue
print("---------- Задача №6 ----------")
i = 0
while i < len(colors):
    print (colors[i])
    i = i + 1

# Задача №7
# Лекция №6: Циклы
# Тема: Цикл for — итерация элементов с условием и break

# Дано:
numbers = [4, 7, 10, 3, 15, 8]

# Используя цикл for, перебери числа из списка.
# Выводи каждое число.
# Когда встретится число 15, останови цикл с помощью break.
# Число 15 тоже должно быть выведено.
# Ожидаемый результат:
# 4
# 7
# 10
# 3
# 15
print("---------- Задача №7 ----------")

for number in numbers:
    print(number)
    if number == 15:
        break

# Задача №8
# Лекция №6: Циклы
# Тема: for + if + break

# Дано:
numbers = [12, 5, 18, 7, 20, 3, 14, 9]

# Используя цикл for, перебери числа из списка.
# Выводи только те числа, которые больше 10.
# Когда встретится число 20, выведи его и останови цикл с помощью break.
# Числа после 20 выводиться не должны.

# Ожидаемый результат:
# 12
# 18
# 20

print("---------- Задача №8 ----------")

for number in numbers:
    if number == 20:
        print(number)
        break
    elif number > 10:
        print(number)

# Задача №9
# Лекция №6: Циклы
# Тема: for + условия + break + подсчёт

# Дано:
numbers = [6, 13, 4, 17, 9, 22, 15, 8, 30]

count = 0
total = 0

# 1. Перебери числа списка с помощью цикла for.
#
# 2. Если число меньше 10:
#    - пропусти его и переходи к следующему числу.
#
# 3. Если число равно 22:
#    - останови цикл с помощью break.
#    - число 22 не должно учитываться в подсчёте.
#
# 4. Для остальных чисел, которые больше или равны 10:
#    - увеличивай count на 1;
#    - добавляй число к total.
#
# 5. После завершения цикла выведи count и total.
#
# Ожидаемый результат:
# count = 3
# total = 39
#
# Важно:
# Числа после 22 не должны обрабатываться.
# Числа меньше 10 не должны учитываться в подсчёте.

print("---------- Задача №9 ----------")

for number in numbers:
    if number == 22:
        break
    elif number < 10:
        continue
    elif number >= 10:
        total = total + number
        count = count + 1
print(count)
print(total)


# Лекция №6: Циклы
# Тема: Вложенные циклы (for внутри for)

# Дано:
rows = [1, 2, 3]
columns = [1, 2, 3]

# 1. Создай внешний цикл for, который перебирает rows.
# 2. Внутри него создай ещё один цикл for,
#    который перебирает columns.
# 3. Внутри внутреннего цикла выводи оба значения:
#    сначала число из rows, затем число из columns.
#
# Ожидаемый результат:
# 1 1
# 1 2
# 1 3
# 2 1
# 2 2
# 2 3
# 3 1
# 3 2
# 3 3

print("---------- Задача №10 ----------")

for row in rows:
    for column in columns:
        print(row, column)