# Задача №1
# Лекция №5: Словари
# Тема: Проверка наличия ключей в словаре

# Дано:
user = {
    "name": "Alex",
    "age": 25,
    "city": "Amsterdam"
}

# Проверь, есть ли в словаре ключ "age".
# Выведи результат проверки.
# Ожидаемый результат:
# True
print("---------- Задача №1 ----------")

assert "age" in user
print(True)

# Задача №2
# Лекция №5: Словари
# Тема: Добавление и обновление элементов словаря

# Дано:
product = {
    "name": "Laptop",
    "price": 800
}

# Измени цену товара на 950.
# Добавь новый ключ "brand" со значением "Lenovo".
# Выведи получившийся словарь.
# Ожидаемый результат:
# {'name': 'Laptop', 'price': 950, 'brand': 'Lenovo'}
print("---------- Задача №2 ----------")
product["brand"] = "Lenovo"
product["price"] = 950

print(product)


# Задача №3
# Лекция №5: Словари
# Тема: Получение ключей, значений и элементов словаря

# Дано:
student = {
    "name": "Maria",
    "age": 22,
    "grade": 5
}

# Получи все значения словаря и выведи их.
# Ожидаемый результат:
# dict_values(['Maria', 22, 5])
print("---------- Задача №3 ----------")

a = student.values()
print(a)

# Задача №4
# Лекция №5: Словари
# Тема: Удаление элементов словаря

# Дано:
game = {
    "title": "Minecraft",
    "year": 2011,
    "price": 30
}

# Удали из словаря ключ "price".
# Выведи получившийся словарь.
# Ожидаемый результат:
# {'title': 'Minecraft', 'year': 2011}
print("---------- Задача №4 ----------")
del game["price"]
print(game)


# Задача №5
# Лекция №5: Словари
# Тема: Доступ к элементам словаря по ключу

# Дано:
book = {
    "title": "Harry Potter",
    "author": "J. K. Rowling",
    "year": 1997
}

# Выведи автора книги, используя его ключ в словаре.
# Ожидаемый результат:
# J. K. Rowling
print("---------- Задача №5 ----------")
print(book["author"])

# Задача №6
# Лекция №5: Словари
# Тема: Проверка наличия значений в словаре

# Дано:
car = {
    "brand": "Toyota",
    "model": "Camry",
    "year": 2022
}

# Проверь, есть ли значение "Toyota" среди значений словаря.
# Выведи результат проверки.
# Ожидаемый результат:
# True
print("---------- Задача №6 ----------")

assert "Toyota" in car.values()
print(True)

if "Toyota" in car.values():
    print("Toyota is in the car")

# Задача №7
# Лекция №5: Словари
# Тема: Получение ключей словаря

# Дано:
phone = {
    "brand": "Samsung",
    "model": "Galaxy S24",
    "color": "black"
}

# Получи все ключи словаря и выведи их.
# Ожидаемый результат:
# dict_keys(['brand', 'model', 'color'])
print("---------- Задача №7 ----------")

print(phone.keys())


# Задача №8
# Лекция №5: Словари
# Тема: Создание словаря

# Создай словарь с тремя элементами:
# "name" со значением "Alex"
# "age" со значением 28
# "city" со значением "Berlin"
#
# Выведи получившийся словарь.
# Ожидаемый результат:
# {'name': 'Alex', 'age': 28, 'city': 'Berlin'}
print("---------- Задача №8 ----------")

user = {
    "name": "Alex",
    "age": 28,
    "city": "Berlin"
}

print(user)

# Задача №9
# Лекция №5: Словари
# Тема: Вложенные словари

# Дано:
users = {
    "user1": {
        "name": "Alex",
        "age": 25
    },
    "user2": {
        "name": "Maria",
        "age": 30
    }
}

# Выведи имя пользователя "Maria" из вложенного словаря.
# Ожидаемый результат:
# Maria
print("---------- Задача №9 ----------")

print(users["user2"]["name"])